 # DATA PROJECTION STATEMENTS

## Create Connection

In [1]:
#mysql connector for creating connection
import mysql.connector

In [2]:

# Connecting from the server
database = mysql.connector.connect(user = 'root',
                               host = 'localhost',
                              passwd = 'Tharif786')

In [3]:
# Preparing a cursor object
cursor = database.cursor()

In [5]:
cursor.execute("USE CompanyDatabase")

## Multi column

In [6]:
query = "SELECT FirstName, LastName, Salary FROM Employees"
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

('John', 'Doe', Decimal('50000.00'))
('Jane', 'Smith', Decimal('60000.00'))
('Mike', 'Brown', Decimal('55000.00'))
('Emily', 'White', Decimal('62000.00'))
('David', 'Black', Decimal('70000.00'))

## Column Alias

In [7]:
query = "SELECT FirstName AS 'First Name', LastName AS 'Last Name', Salary AS 'Monthly Salary' FROM Employees"
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

('John', 'Doe', Decimal('50000.00'))
('Jane', 'Smith', Decimal('60000.00'))
('Mike', 'Brown', Decimal('55000.00'))
('Emily', 'White', Decimal('62000.00'))
('David', 'Black', Decimal('70000.00'))

## Basic Arithmetic Operations

In [8]:
query = "SELECT FirstName, LastName, Salary, (Salary * 12) AS AnnualSalary FROM Employees"
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

('John', 'Doe', Decimal('50000.00'), Decimal('600000.00'))
('Jane', 'Smith', Decimal('60000.00'), Decimal('720000.00'))
('Mike', 'Brown', Decimal('55000.00'), Decimal('660000.00'))
('Emily', 'White', Decimal('62000.00'), Decimal('744000.00'))
('David', 'Black', Decimal('70000.00'), Decimal('840000.00'))

## Distinct Records

In [10]:
query = "SELECT DISTINCT DepartmentID FROM Employees"
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

(101,)
(102,)
(103,)

## Concatenation

In [11]:
query = "SELECT CONCAT(FirstName, ' ', LastName) AS FullName, DepartmentID FROM Employees"
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

('John Doe', 101)
('Jane Smith', 102)
('Mike Brown', 101)
('Emily White', 103)
('David Black', 102)

## Basic Where

In [12]:
query = "SELECT FirstName, LastName, Salary FROM Employees WHERE Salary > 50000"
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

('Jane', 'Smith', Decimal('60000.00'))
('Mike', 'Brown', Decimal('55000.00'))
('Emily', 'White', Decimal('62000.00'))
('David', 'Black', Decimal('70000.00'))

In [14]:
query = """
SELECT 
    FirstName AS 'First Name',
    LastName AS 'Last Name',
    (Salary * 12) AS AnnualSalary 
FROM Employees
WHERE DepartmentID = 101 AND Salary > 40000
"""
cursor.execute(query)

# Fetch and display results
for row in cursor.fetchall():
    print(row)

('John', 'Doe', Decimal('600000.00'))
('Mike', 'Brown', Decimal('660000.00'))

In [15]:
cursor.close()

True

In [16]:
database.close()